AccumulationRegisters/ТТМ_УчетСерийныхНомеровПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТТМ_УчетСерийныхНомеровПродукции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШильдЗаказан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Произведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonForms/ТТМ_ВводСерийныхНомеровСДаннымиИзТЧ/Ext/Form/Module.bsl
// ==================== ОПИСАНИЕ ==================== //
// Данная форма может вызываться из общего модуля, её //
// работа заключается в том, что бы брать номенклату- //
// ру из табличной части документа, который создает...//
// ...приход и позволять пользователю установить сери-//
// -йный номер и добавить приход в РН со всеми нужными//
// данными для учёта...                               //
// ================ ДАТА: 17.10.2025 ================ //
// ================ Автор: Панин А.А ================ //



////////////////////////////////////////////////////////////////////////

#Область ОбработчикиКомандФормы
&НаКлиенте

Процедура ЗаписатьНомера()
	
	
	Если ЕстьДублиСерийВТЧ(ТЧСерийныеНомера) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Найдены дубли серийных номеров в таблице. Запись отменена.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	
	
	// 1) Снимем движения, что бы не дублировать записи
	ОтменитьПриходПоРегистраторуСервер(ДокОснование, Номенклатура);
	
	// 2) Сформируем "отвязанные" данные (ничего из формы напрямую не передаём)
	ТЗСерий = ТЧСерийныеНомера; 
	
	ЛДокОснование       = ДокОснование;
	ЛСклад              = Склад;
	ЛНоменклатура       = Номенклатура;
	ЛНазначение         = Назначение;
	
	ЛШильдЗаказан       = ?(ТипЗнч(ШильдЗаказан)=Тип("Булево"), ШильдЗаказан, Ложь);
	ЛПроизведено        = Ложь; 											//Неопределено;
	ЛДатаПроизводства   = Дата(1,1,1);										//Неопределено;
	ЛДокументРеализации = ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"); 
	ЛРеализовано        = Ложь;         									// на приходе Ложь
	
		
	
	
	// 3) Серверный вызов - только простые значения и наша ТЗ-копия
	ЗаписатьПриходИзФормыСервер(
	ЛДокОснование,
	ЛСклад,
	ЛНоменклатура,
	ЛНазначение,
	ЛШильдЗаказан,
	ЛПроизведено,
	ЛДатаПроизводства,
	ЛДокументРеализации,
	ЛРеализовано,
	ТЗСерий
	);
	
	Закрыть(Истина);
	Сообщить("Серийные номера успешно записаны");
	
	КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМассово(Команда) ////// Процедура делает массовое заполнение серийниками по указанным ТМ - Дата и добавляет по +1 от начального порядкового номера

	// простые проверки
	Если ПустаяСтрока(КодТМ5) Тогда
		Сообщить("Укажите Код ТМ (5 цифр).");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ДатаКод5) Тогда
		Сообщить("Укажите Дата-код (5 цифр).");
		Возврат;
	КонецЕсли;
	Если НачальныйНомер = Неопределено Тогда
		Сообщить("Укажите начальный порядковый номер.");
		Возврат;
	КонецЕсли;

	// посчитаем отмеченные строки
	КолОтмеченных = 0;
	Для Каждого Стр Из ТЧСерийныеНомера Цикл
		Если Истина = Стр.Массово Тогда
			КолОтмеченных = КолОтмеченных + 1;
		КонецЕсли;
	КонецЦикла;

	Если КолОтмеченных = 0 Тогда
		Сообщить("Не отмечено ни одной строки для массового заполнения.");
		Возврат;
	КонецЕсли;

	// заполняем только отмеченные; при флаге - только пустые серийники
	ТекНомер = НачальныйНомер;
	Заполнено = 0;

	Для Каждого Стр Из ТЧСерийныеНомера Цикл
		Если Не Истина = Стр.Массово Тогда Продолжить; КонецЕсли;
		Если ЗначениеЗаполнено(ТолькоПустые) И ТолькоПустые И Не ПустаяСтрока(Стр.СерийныйНомер) Тогда Продолжить; КонецЕсли;

		Стр.СерийныйНомер = СформироватьRaw14(КодТМ5, ДатаКод5, ТекНомер); // 14 цифр без дефисов
		ТекНомер = ТекНомер + 1;
		Заполнено = Заполнено + 1;
	КонецЦикла;

	Попытка Элементы.ТЧСерийныеНомера.Обновить(); Исключение КонецПопытки;

	Последний = ТекНомер - 1;
	Сообщить("Заполнено строк: " + Заполнено + ". Диапазон: " + НачальныйНомер + "…" + Последний);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделение(Команда)
	
	Если ТЧСерийныеНомера = Неопределено Тогда Возврат; КонецЕсли;

	Для Каждого Стр Из ТЧСерийныеНомера Цикл
		// снимаем флажок "Массово" у всех строк
		Стр.Массово = Ложь;
	КонецЦикла;

	Попытка Элементы.ТЧСерийныеНомера.Обновить(); Исключение КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Если ТЧСерийныеНомера = Неопределено Тогда Возврат; КонецЕсли;

	Для Каждого Стр Из ТЧСерийныеНомера Цикл
		// проставляем флажок "Массово" всем строкам
		Стр.Массово = Истина;
	КонецЦикла;

	// обновим грид табличной части (если элемент присутствует)
	Попытка Элементы.ТЧСерийныеНомера.Обновить(); Исключение КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ДиалогСВопросом(Команда)
 
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Вы уверены, что хотите записать указанные серии?",
        РежимДиалогаВопрос.ДаНет,
        0, // таймаут в секундах
        КодВозвратаДиалога.Нет, // (необ.) кнопка по умолчанию
        "Продолжить?" // (необ.) заголовок
    );    
 
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////

#Область ЗаписьДвиженияВРН
&НаСервереБезКонтекста
Процедура ОтменитьПриходПоРегистраторуСервер(ДокОснование, Номенклатура = Неопределено) Экспорт

	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокОснование);
	НЗ.Прочитать();

	Если Номенклатура = Неопределено Тогда
		// Полная очистка по регистратору (как раньше)
		НЗ.Очистить();
		НЗ.Записать(Истина);
		Возврат;
	КонецЕсли;

	// Частичная очистка: удаляем только НЕ реализованные по номенклатуре,
	// реализованные серии сохраняем.
	Инд = НЗ.Количество() - 1;
	Пока Инд >= 0 Цикл
		Стр = НЗ[Инд];
		Если Стр.Номенклатура = Номенклатура
			И НЕ Стр.Реализовано Тогда
			НЗ.Удалить(Инд);
		КонецЕсли;
		Инд = Инд - 1;
	КонецЦикла;

	НЗ.Записать(Истина);

КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьПриходИзФормыСервер(
	ДокОснование,
	Склад,
	Номенклатура,
	Назначение,
	ШильдЗаказан,
	Произведено,
	ДатаПроизводства,
	ДокументРеализации,
	Реализовано,
	ТЗСерий // строки с СерийныйНомер (raw14 или уже формат)
) Экспорт

	
	// 0) очищаем ТЕКУЩИЕ движения по регистратору
	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокОснование);
	НЗ.Прочитать(); 

	// Сохраняем реализованные серии (их не перезаписываем)
	СохранитьРеализованные = Новый Массив;
	Для Каждого СтрНЗ Из НЗ Цикл
		Если СтрНЗ.Номенклатура = Номенклатура
			И СтрНЗ.Реализовано Тогда
			СохранитьРеализованные.Добавить(СтрНЗ);
		КонецЕсли;
	КонецЦикла;

	// Очищаем все движения регистратора по этой номенклатуре (нереализованные удалятся)
	Инд = НЗ.Количество() - 1;
	Пока Инд >= 0 Цикл
		Стр = НЗ[Инд];
		Если Стр.Номенклатура = Номенклатура Тогда
			НЗ.Удалить(Инд);
		КонецЕсли;
		Инд = Инд - 1;
	КонецЦикла;

	// Вернем сохраненные реализованные строки
	Для Каждого СтрСохр Из СохранитьРеализованные Цикл
		Новая = НЗ.Добавить();
		Новая.Период             = СтрСохр.Период;
		Новая.ВидДвижения        = СтрСохр.ВидДвижения;
		Новая.Регистратор        = ДокОснование;
		Новая.Склад              = СтрСохр.Склад;
		Новая.Номенклатура       = СтрСохр.Номенклатура;
		Новая.Назначение         = СтрСохр.Назначение;
		Новая.СерийныйНомер      = СтрСохр.СерийныйНомер;
		Новая.ШильдЗаказан       = СтрСохр.ШильдЗаказан;
		Новая.Произведено        = СтрСохр.Произведено;
		Новая.ДатаПроизводства   = СтрСохр.ДатаПроизводства;
		Новая.ДокументРеализации = СтрСохр.ДокументРеализации;
		Новая.Реализовано        = Истина;
		Новая.Количество         = СтрСохр.Количество;
	КонецЦикла;

	// Добавляем новые приходы по ТЗ (нереализованные)
	УжеЕстьСерии = Новый Соответствие; // ключ = СерийныйНомер
	Для Каждого СтрСохр Из СохранитьРеализованные Цикл
		Если УжеЕстьСерии.Получить(СтрСохр.СерийныйНомер) = Неопределено Тогда
			УжеЕстьСерии.Вставить(СтрСохр.СерийныйНомер, Истина);
		КонецЕсли;
	КонецЦикла;

	ПериодЗаписи = ТекущаяДата();
	Для Каждого СтрФ Из ТЗСерий Цикл
		Если НЕ ЗначениеЗаполнено(СтрФ.СерийныйНомер) Тогда
			Продолжить;
		КонецЕсли;

		Норм = НормализоватьВоВход14(СтрФ.СерийныйНомер);
		Если НЕ Норм.Успех Тогда
			ВызватьИсключение Норм.Сообщение;
		КонецЕсли;
		ФорматСН = ФорматДляРН(Норм.Raw14);

		Если УжеЕстьСерии.Получить(ФорматСН) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		УжеЕстьСерии.Вставить(ФорматСН, Истина);

		Зап = НЗ.Добавить();
		Зап.Период             = ПериодЗаписи;
		Зап.ВидДвижения        = ВидДвиженияНакопления.Приход;
		Зап.Регистратор        = ДокОснование;
		Зап.Склад              = Склад;
		Зап.Номенклатура       = Номенклатура;
		Зап.Назначение         = Назначение;
		Зап.СерийныйНомер      = ФорматСН;
		Зап.ШильдЗаказан       = ?(ТипЗнч(ШильдЗаказан)=Тип("Булево"), ШильдЗаказан, Ложь);
		Зап.Произведено        = Произведено;
		Зап.ДатаПроизводства   = ДатаПроизводства;
		Зап.ДокументРеализации = ДокументРеализации;
		Зап.Реализовано        = Ложь;
		Зап.Количество         = 1;
	КонецЦикла;

	НЗ.Записать(Истина);
		
	
	//// 1) построим множество "уже есть" для защиты от дублей в ЭТОМ регистраторе
	//УжеЕсть = Новый Соответствие; // ключ = Номенклатура|СерийныйНомер|Приход
	//Для Инд = 0 По НЗ.Количество()-1 Цикл
	//	СтрНЗ = НЗ[Инд];
	//	Если СтрНЗ.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
	//		Ключ = Строка(СтрНЗ.Номенклатура) + "|" + СтрНЗ.СерийныйНомер + "|Приход";
	//		Если УжеЕсть.Получить(Ключ) = Неопределено Тогда
	//			УжеЕсть.Вставить(Ключ, Истина);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;

	//// 2) добавляем ТОЛЬКО новые записи по текущей номенклатуре
	//Для Каждого СтрФ Из ТЗСерий Цикл
	//	// нормализуем/форматируем (пользуемся твоими функциями)
	//	РезНорм = НормализоватьВоВход14(СтрФ.СерийныйНомер);
	//	Если Не РезНорм.Успех Тогда
	//		Продолжить; // или ВызватьИсключение(РезНорм.Сообщение);
	//	КонецЕсли;
	//	ФорматСН = ФорматДляРН(РезНорм.Raw14);

	//	Ключ = Строка(Номенклатура) + "|" + ФорматСН + "|Приход";
	//	Если УжеЕсть.Получить(Ключ) <> Неопределено Тогда
	//		Продолжить; // такой приход уже записан этим регистратором — не дублируем
	//	КонецЕсли;

	//	Зап = НЗ.Добавить();
	//	Зап.Период             = ТекущаяДата();
	//	Зап.ВидДвижения        = ВидДвиженияНакопления.Приход;
	//	Зап.Регистратор        = ДокОснование;

	//	Зап.Склад              = Склад;
	//	Зап.Номенклатура       = Номенклатура;
	//	Зап.Назначение         = Назначение;
	//	Зап.СерийныйНомер      = ФорматСН;

	//	Зап.ШильдЗаказан       = ?(ТипЗнч(ШильдЗаказан)=Тип("Булево"), ШильдЗаказан, Ложь);
	//	Зап.Произведено        = Произведено;
	//	Зап.ДатаПроизводства   = ДатаПроизводства;

	//	Зап.ДокументРеализации = ДокументРеализации; // как правило пусто на приходе
	//	Зап.Реализовано        = Реализовано;        // как правило Ложь
	//	Зап.Количество         = 1;
	//КонецЦикла;

	//// 3) пишем набор ЦЕЛИКОМ — теперь это "старые + новые"
	//НЗ.Записать(Истина);

КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПолучитьОстаткиСерийНоменклатуры(Номенклатура, ДокОснование, ТЗСерий);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПринятыеТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ПринятыеТовары.Количество) КАК Количество,
	               |	ПринятыеТовары.ДокументПриемки КАК ДокументПриемки
	               |ПОМЕСТИТЬ Вт_ПринятаяНоменклатура
	               |ИЗ
	               |	&ПринятыеТовары КАК ПринятыеТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПринятыеТовары.Номенклатура,
	               |	ПринятыеТовары.ДокументПриемки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Период КАК Период,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК Регистратор,
	               |	ТТМ_УчетСерийныхНомеровПродукции.НомерСтроки КАК НомерСтроки,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Активность КАК Активность,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ВидДвижения КАК ВидДвижения,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Склад КАК Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение КАК Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ШильдЗаказан КАК ШильдЗаказан,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Произведено КАК Произведено,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства КАК ДатаПроизводства,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации КАК ДокументРеализации,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Реализовано КАК Реализовано,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Количество КАК Количество,
	               |	ТТМ_УчетСерийныхНомеровПродукции.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_ПринятаяНоменклатура КАК Вт_Номенклатура
	               |		ПО ТТМ_УчетСерийныхНомеровПродукции.Регистратор = Вт_Номенклатура.ДокументПриемки
	               |			И ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = Вт_Номенклатура.Номенклатура
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ПриемкаТоваровНаХранение";    
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Скопировать(,"");
	//ТабТовары = ТЗСерий.Скопировать()
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Регистратор", ДокОснование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//
//Процедура ЗаписатьПриходИзФормыСервер(
//	ДокОснование,
//	Склад,
//	Номенклатура,
//	Назначение,
//	ШильдЗаказан,
//	Произведено,
//	ДатаПроизводства,
//	ДокументРеализации,
//	Реализовано,
//	ТЗСерий // это уже "свободная" ТаблицаЗначений
//	)
//	// Собираем ТЗ под регистр
//	ТЗ = Новый ТаблицаЗначений;
//	ТЗ.Колонки.Добавить("Склад");
//	ТЗ.Колонки.Добавить("Номенклатура");
//	ТЗ.Колонки.Добавить("Назначение");
//	ТЗ.Колонки.Добавить("СерийныйНомер");
//	ТЗ.Колонки.Добавить("ШильдЗаказан");
//	ТЗ.Колонки.Добавить("Произведено");
//	ТЗ.Колонки.Добавить("ДатаПроизводства");
//	ТЗ.Колонки.Добавить("ДокументРеализации");
//	ТЗ.Колонки.Добавить("Реализовано");
//	ТЗ.Колонки.Добавить("Количество");
//	
//	
//	Для Каждого СтрФ Из ТЗСерий Цикл
//		// СтрФ.СерийныйНомер - ожидание: 14 цифр без дефисов (или >=12, мы дотянем)
//		Норм = НормализоватьВоВход14(СтрФ.СерийныйНомер);
//		Если Не Норм.Успех Тогда
//			ВызватьИсключение Норм.Сообщение; // или Продолжить, если хотите пропускать
//		КонецЕсли;
//		
//		Формат = ФорматДляРН(Норм.Raw14); // "xxxxx-xxxxx-xxxx"
//		
//		Новая = ТЗ.Добавить();
//		Новая.Склад              = Склад;
//		Новая.Номенклатура       = Номенклатура; // или СтрФ.Номенклатура
//		Новая.Назначение         = Назначение;
//		Новая.СерийныйНомер      = Формат;       // <<< в РН УЖЕ С ДЕФИСАМИ
//		Новая.ШильдЗаказан       = ШильдЗаказан;
//		Новая.Произведено        = Произведено;
//		Новая.ДатаПроизводства   = ДатаПроизводства;
//		Новая.ДокументРеализации = ДокументРеализации;
//		Новая.Реализовано        = Реализовано;
//		Новая.Количество         = 1;
//	КонецЦикла;
//	
//		
//	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
//	НЗ.Отбор.Регистратор.Значение = ДокОснование;
//	НЗ.Загрузить(ТЗ);
//	
//	Период = ТекущаяДата(); // Дата в записи РН - на момент нажатия кнопки "Записать серийные номера"
//	Для Каждого СтрНЗ Из НЗ Цикл
//		СтрНЗ.Период       = Период;
//		СтрНЗ.ВидДвижения  = ВидДвиженияНакопления.Приход;
//		СтрНЗ.Регистратор  = ДокОснование;
//		
//	КонецЦикла;
//	
//	НЗ.Записать(Истина);

//КонецПроцедуры
#КонецОбласти

////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	//// Гарантируем таблицу и колонки
	//Если ТЧСерийныеНомера = Неопределено Тогда
	//	ТЧСерийныеНомера = Новый("ТаблицаЗначений");
	//	Попытка
	//		ТЧСерийныеНомера.Колонки.Добавить("Номенклатура");
	//		ТЧСерийныеНомера.Колонки.Добавить("СерийныйНомер");
	//	Исключение
	//		// если колонки уже есть - ничего не делаем
	//	КонецПопытки;
	//КонецЕсли; 
	
	
	
	// Принимаем параметры как есть
	ДокОснование       = Параметры.ДокОснование;
	Склад              = Параметры.Склад;
	Номенклатура       = Параметры.Номенклатура;
	Назначение         = Справочники.Назначения.ПустаяСсылка();
	Параметры.Свойство("Назначение", Назначение);
	Количество         = Параметры.Количество;
	ШильдЗаказан       = Ложь;
	Произведено        = Ложь;
	ДатаПроизводства   = Дата(1,1,1);
	ДокументРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	Реализовано        = Ложь;      
	
	ТаблицаСерийныхНомеров = Неопределено;
	АдресТабСерииТоваров = Неопределено;
	Если Параметры.Свойство("АдресТабСерииТоваров", АдресТабСерииТоваров)
		И ЗначениеЗаполнено(АдресТабСерииТоваров) Тогда
		ТаблицаСерийныхНомеров = ПолучитьИзВременногоХранилища(АдресТабСерииТоваров);
	КонецЕсли;
	
	// Заполняем табличную часть на нужное количество строк
	Попытка
		ТЧСерийныеНомера.Очистить();
	Исключение
		// на всякий случай
	КонецПопытки;
	
	Если ТипЗнч(ТаблицаСерийныхНомеров) = Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрСерий Из ТаблицаСерийныхНомеров Цикл
			Если СтрСерий.Номенклатура = Номенклатура Тогда
				Стр = ТЧСерийныеНомера.Добавить();
				Стр.Номенклатура = Номенклатура;
				Стр.СерийныйНомер = ОставитьЦифры(Строка(СтрСерий.СерийныйНомер));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ТЧСерийныеНомера.Количество() < Цел(Количество) Тогда
		Для Н = ТЧСерийныеНомера.Количество() + 1 По Цел(Количество) Цикл
			Стр = ТЧСерийныеНомера.Добавить();
			Стр.Номенклатура  = Номенклатура;
			Стр.СерийныйНомер = "";
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧСерийныеНомераСерийныйНомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Парам, СтандартнаяОбработка)
	Рез = НормализоватьВоВход14(Текст); // функция, возвращает .Успех и .Raw14
	Если Не Рез.Успех Тогда
		СообщитьПользователюНемодально(Рез.Сообщение); // вместо Предупреждение()
		// Сбрасываем ввод
		ТекСтрока = Элементы.ТЧСерийныеНомера.ТекущиеДанные;
		Если ТекСтрока <> Неопределено Тогда
			ТекСтрока.СерийныйНомер = ""; 
		КонецЕсли;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	ТекСтрока = Элементы.ТЧСерийныеНомера.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ТекСтрока.СерийныйНомер = Рез.Raw14; // в ТЧ храним 14 цифр БЕЗ дефисов
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////// 

#Область СлужебныеПроцедурыИфункции 

&НаКлиенте
Процедура СообщитьПользователюНемодально(Текст)
	Сооб = Новый СообщениеПользователю;
	Сооб.Текст = Текст;
	Сооб.Сообщить();
КонецПроцедуры

 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаписатьНомера();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Сообщить("Запись серийных номеров отменена пользователем");
    КонецЕсли;	
 
КонецПроцедуры


// ===== ХЕЛПЕРЫ: функции для обработки поступающих строк ===== //

&НаКлиентеНаСервереБезКонтекста 
Функция ЕстьДублиСерийВТЧ(ТЧ) Экспорт /////////////////////////////////////////// Ищет дубли в табличной части
	Если ТЧ = Неопределено Тогда Возврат Ложь; КонецЕсли;

	Видены = Новый Соответствие; // ключ = точное значение в колонке СерийныйНомер
	Для Каждого Стр Из ТЧ Цикл
		Значение = Стр.СерийныйНомер;
		Если ПустаяСтрока(Значение) Тогда Продолжить; КонецЕсли;

		// если ключ уже вставляли — Получить() вернёт не Неопределено
		Если Видены.Получить(Значение) <> Неопределено Тогда
			Возврат Истина; // дубль найден
		КонецЕсли;

		Видены.Вставить(Значение, Истина);
	КонецЦикла;

	Возврат Ложь;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПовторСимвола(Символ, Количество) Экспорт /////////////////////////////// Повторяет в строке указанный символ указанное количество раз, возвращает строку
	Если Количество <= 0 Тогда Возврат ""; КонецЕсли;
	Рез = "";
	Для Сч = 1 По Количество Цикл
		Рез = Рез + Символ;
	КонецЦикла;
	Возврат Рез;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОставитьЦифры(Текст) Экспорт //////////////////////////////////////////// Убирает все "Левые" символы из серийного номера
	
	Если Текст = Неопределено Тогда Возврат ""; КонецЕсли;
	Рез = "";
	Для Сч = 1 По СтрДлина(Текст) Цикл
		Сим = Сред(Текст, Сч, 1);
		Если Сим >= "0" И Сим <= "9" Тогда Рез = Рез + Сим; КонецЕсли;
	КонецЦикла;
	Возврат Рез;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НормализоватьВоВход14(СыройТекст) Экспорт /////////////////////////////// Контролирует длинну серийного номера, дополняет нулями, еслил длина меньше 14
	
	Лок = ОставитьЦифры(СыройТекст);
	Дл = СтрДлина(Лок);
	Если Дл < 12 Тогда
		Возврат Новый Структура("Успех,Сообщение", Ложь, "Серийный номер должен содержать минимум 12 цифр.");
	КонецЕсли;
	Если Дл > 14 Тогда
		Лок = Лев(Лок, 14);
		Дл = 14;
	КонецЕсли;
	Если Дл < 14 Тогда
		Лок = ПовторСимвола("0", 14 - Дл) + Лок; // дополняем слева
	КонецЕсли;
	Возврат Новый Структура("Успех,Raw14", Истина, Лок);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФорматДляРН(Raw14) Экспорт ////////////////////////////////////////////// Собирает строку формата " ххххх-ххххх-хххх " и добавляет нули, если СН не 5-5-4
	Raw14 = ОставитьЦифры(Raw14);
	Если СтрДлина(Raw14) < 14 Тогда Raw14 = ПовторСимвола("0", 14 - СтрДлина(Raw14)) + Raw14; КонецЕсли;
	Если СтрДлина(Raw14) > 14 Тогда Raw14 = Лев(Raw14, 14); КонецЕсли;
	Возврат Сред(Raw14,1,5) + "-" + Сред(Raw14,6,5) + "-" + Сред(Raw14,11,4);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьRaw14(КодТМ5, ДатаКод5, Порядковый) Экспорт ///////////////// Получает на вход 5-5-4 и собирает из этого СН формата " хххххххххххххх "
	Код  = ОставитьЦифры(КодТМ5);
	Дата = ОставитьЦифры(ДатаКод5);
	Если СтрДлина(Код)  > 5 Тогда Код  = Лев(Код,5);  КонецЕсли;
	Если СтрДлина(Дата) > 5 Тогда Дата = Лев(Дата,5); КонецЕсли;
	Если СтрДлина(Код)  < 5 Тогда Код  = ПовторСимвола("0", 5-СтрДлина(Код))  + Код;  КонецЕсли;
	Если СтрДлина(Дата) < 5 Тогда Дата = ПовторСимвола("0", 5-СтрДлина(Дата)) + Дата; КонецЕсли;

	Пор = ОставитьЦифры(Строка(Порядковый));
	Если СтрДлина(Пор) > 4 Тогда Пор = Прав(Пор,4); КонецЕсли;
	Если СтрДлина(Пор) < 4 Тогда Пор = ПовторСимвола("0", 4-СтрДлина(Пор)) + Пор; КонецЕсли;

	Возврат Код + Дата + Пор; // 14 цифр без дефисов
КонецФункции
#КонецОбласти

////////////////////////////////////////////////////////////////////////
